In [6]:
import pandas as pd
import numpy as np

In [7]:
s1=pd.Series([12,34,5,6,7,'32','N'])
s1

0    12
1    34
2     5
3     6
4     7
5    32
6     N
dtype: object

In [8]:
s2=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
s3=pd.Series([1,2,3],index=['a','b','c'],dtype="float")
s3

a    1.0
b    2.0
c    3.0
dtype: float64

Creation of Series using Dictionary

In [7]:
s4=pd.Series({"a":1,"b":2,"c":3},dtype="float")
s4

a    1.0
b    2.0
c    3.0
dtype: float64

DataFrame

What is a DataFrame?

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [8]:
d1=pd.DataFrame([1,2,3,4])
d1

   0
0  1
1  2
2  3
3  4

In [10]:
d2=pd.DataFrame([[1,2,3,4],[5,6,7,8]])
d2

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [11]:
#Converting series into dataframe
d3=pd.DataFrame(s2)
d3

   0
a  1
b  2
c  3
d  4
e  5

In [13]:
d4=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=['a','b','c'])
d4

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [14]:
d5=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=['x','y','z'],columns=['a','b','c'])
d5

   a  b  c
x  1  2  3
y  4  5  6
z  7  8  9

creating DataFrame from list of dictionaries

In [15]:
dict=[{"a":1,'b':2},{'c':3,'d':4},{'e':5,'f':6}]
pd.DataFrame(dict,index=['x','y','z'])

     a    b    c    d    e    f
x  1.0  2.0  NaN  NaN  NaN  NaN
y  NaN  NaN  3.0  4.0  NaN  NaN
z  NaN  NaN  NaN  NaN  5.0  6.0

DataFrame Operations

In [16]:
d3

   0
a  1
b  2
c  3
d  4
e  5

In [17]:
d4

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [19]:
print(d4['a'])
print(d4['b'])

0    1
1    4
2    7
Name: a, dtype: int64
0    2
1    5
2    8
Name: b, dtype: int64

In [21]:
d4['d']=d4['a']*d4['b']
d4['e']=d4['a']+d4['b']
d4

   a  b  c   d   e
0  1  2  3   2   3
1  4  5  6  20   9
2  7  8  9  56  15

In [23]:
d4.pop('b')
d4

   a  c   d   e
0  1  3   2   3
1  4  6  20   9
2  7  9  56  15

In [24]:
del d4['e']
d4

   a  c   d
0  1  3   2
1  4  6  20
2  7  9  56

In [29]:
d4.insert(1,"new1",d4['c'])#(loc, col, data)
d4

   a  new1  new  c   d
0  1     3    3  3   2
1  4     6    6  6  20
2  7     9    9  9  56

In [31]:
d4.pop('new')
d4

   a  new1  c   d
0  1     3  3   2
1  4     6  6  20
2  7     9  9  56

In [33]:
d={'c':1,'new1':33,'e':22}
df11=d4.append(d,ignore_index=True)
df11

     a  new1    c     d     e
0  1.0   3.0  3.0   2.0   NaN
1  4.0   6.0  6.0  20.0   NaN
2  7.0   9.0  9.0  56.0   NaN
3  NaN  33.0  1.0   NaN  22.0

In [34]:
import numpy as np
d5 = pd.DataFrame({'abc':np.random.randint(2,6,size=(10)),'bcd':np.random.randint(4,10,size=(10)),'cde':np.random.randint(3,10,size=(10))})
d5

   abc  bcd  cde
0    3    5    4
1    4    4    6
2    2    8    8
3    4    5    4
4    3    9    9
5    2    6    7
6    4    4    3
7    2    4    6
8    5    7    5
9    3    4    9

In [35]:
d4.head()

   a  new1  c   d
0  1     3  3   2
1  4     6  6  20
2  7     9  9  56

In [36]:
d4.tail()

   a  new1  c   d
0  1     3  3   2
1  4     6  6  20
2  7     9  9  56

In [37]:
'''
Info About the Data
The DataFrames object has a method called info(),that gives you more information about the data set.'''
d4.info()
d4.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   new1    3 non-null      int64
 2   c       3 non-null      int64
 3   d       3 non-null      int64
dtypes: int64(4)
memory usage: 224.0 bytes

         a  new1    c          d
count  3.0   3.0  3.0   3.000000
mean   4.0   6.0  6.0  26.000000
std    3.0   3.0  3.0  27.495454
min    1.0   3.0  3.0   2.000000
25%    2.5   4.5  4.5  11.000000
50%    4.0   6.0  6.0  20.000000
75%    5.5   7.5  7.5  38.000000
max    7.0   9.0  9.0  56.000000

In [38]:
d4

   a  new1  c   d
0  1     3  3   2
1  4     6  6  20
2  7     9  9  56

In [41]:
d4.loc[2,'new1'] #loc[row name,colname]

9

In [42]:
d4.loc[1:2,["a","c"]]

   a  c
1  4  6
2  7  9

In [43]:
d4

   a  new1  c   d
0  1     3  3   2
1  4     6  6  20
2  7     9  9  56

In [44]:
d4.iloc[2,1]#[row index,column index]

9

In [45]:
d4.iloc[1:2,[0,2]]

   a  c
1  4  6

In [46]:
d4

   a  new1  c   d
0  1     3  3   2
1  4     6  6  20
2  7     9  9  56

In [47]:
d4.new1

0    3
1    6
2    9
Name: new1, dtype: int64

In [48]:
# data frame . column .values
d4.new1.values

array([3, 6, 9], dtype=int64)

In [50]:
d4['sub'] = d4.a.values - d4.c.values
d4

   a  new1  c   d  sub
0  1     3  3   2   -2
1  4     6  6  20   -2
2  7     9  9  56   -2

In [51]:
a = [['rk',102,15000],['rama',103,20000],['krishna',104,25000]]
dfl = pd.DataFrame(a,columns = ['name','id','salary'])
dfl

      name   id  salary
0       rk  102   15000
1     rama  103   20000
2  krishna  104   25000

In [52]:
y=dfl[dfl.salary>=20000]
print(y)
y[['id','salary']]

      name   id  salary
1     rama  103   20000
2  krishna  104   25000

    id  salary
1  103   20000
2  104   25000

In [53]:
dfl.append({'name' : 'sajan','id' : 105,'salary' : 30000},ignore_index=True)

      name   id  salary
0       rk  102   15000
1     rama  103   20000
2  krishna  104   25000
3    sajan  105   30000

In [58]:
df1 = dfl.append({'name' : np.nan,'id' : 105,'salary' : 30000},ignore_index = True)
df1

      name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3      NaN  105.0  30000.0
4      NaN  105.0  30000.0
5      NaN  105.0  30000.0

In [59]:
df1.isnull()

    name     id  salary
0  False  False   False
1  False  False   False
2  False  False   False
3   True  False   False
4   True  False   False
5   True  False   False

In [60]:
print(df1.isnull().sum())

name      3
id        0
salary    0
dtype: int64

In [61]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   id      6 non-null      float64
 2   salary  6 non-null      float64
dtypes: float64(2), object(1)
memory usage: 272.0+ bytes

In [62]:
df1.dropna()

      name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0

In [63]:
df1

      name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3      NaN  105.0  30000.0
4      NaN  105.0  30000.0
5      NaN  105.0  30000.0

In [67]:
df1.fillna(value="abc")

      name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3      abc  105.0  30000.0
4      abc  105.0  30000.0

In [68]:
df1

      name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3      NaN  105.0  30000.0
4      NaN  105.0  30000.0

In [70]:
df1.drop([2],axis=0,inplace=True)
df1

   name     id   salary
0    rk  102.0  15000.0
1  rama  103.0  20000.0
3   NaN  105.0  30000.0
4   NaN  105.0  30000.0

Group By

In [72]:
df=pd.DataFrame({"Cricketer":["Dhoni","Dhoni","Raina","Raina"],"MaxScore":[183,153,142,124],"MinScore":[12,45,12,34]})
df

  Cricketer  MaxScore  MinScore
0     Dhoni       183        12
1     Dhoni       153        45
2     Raina       142        12
3     Raina       124        34

In [73]:
df.groupby(["Cricketer"]).mean()

           MaxScore  MinScore
Cricketer
Dhoni         168.0      28.5
Raina         133.0      23.0

In [74]:
import pandas as pd
import numpy as np
 
df = pd.DataFrame(np.random.randn(4,3),columns=['col1','col2','col3'])
print(df)
print('\n')
for key,value in df.iteritems():
   print(key,value)
   print('\n')

       col1      col2      col3
0 -0.294667  0.487935  0.760754
1  0.109294  1.783207 -1.914660
2  1.256608 -1.916547 -1.201962
3  1.145102 -1.838384  0.477081


col1 0   -0.294667
1    0.109294
2    1.256608
3    1.145102
Name: col1, dtype: float64


col2 0    0.487935
1    1.783207
2   -1.916547
3   -1.838384
Name: col2, dtype: float64


col3 0    0.760754
1   -1.914660
2   -1.201962
3    0.477081
Name: col3, dtype: float64

In [75]:
for key,value in df.iteritems():
   print(key,value)
   print('\n')

col1 0   -0.294667
1    0.109294
2    1.256608
3    1.145102
Name: col1, dtype: float64


col2 0    0.487935
1    1.783207
2   -1.916547
3   -1.838384
Name: col2, dtype: float64


col3 0    0.760754
1   -1.914660
2   -1.201962
3    0.477081
Name: col3, dtype: float64

In [76]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(3,3),columns = ['col1','col2','col3'])
print(df)
print('\n')
for row in df.iterrows():
   print(row)
   print('\n')

       col1      col2      col3
0  0.109634 -1.104669 -0.792734
1 -1.183087 -1.062016  0.717094
2 -0.559171 -0.767518 -0.502370


(0, col1    0.109634
col2   -1.104669
col3   -0.792734
Name: 0, dtype: float64)


(1, col1   -1.183087
col2   -1.062016
col3    0.717094
Name: 1, dtype: float64)


(2, col1   -0.559171
col2   -0.767518
col3   -0.502370
Name: 2, dtype: float64)

In [78]:
df

       col1      col2      col3
0  0.109634 -1.104669 -0.792734
1 -1.183087 -1.062016  0.717094
2 -0.559171 -0.767518 -0.502370

In [79]:
df.T

             0         1         2
col1  0.109634 -1.183087 -0.559171
col2 -1.104669 -1.062016 -0.767518
col3 -0.792734  0.717094 -0.502370

Get Dummies

In [80]:
import pandas as pd

data = {'firstname': ['Arun', 'Jebu', 'Venkat', 'Rekha', 'Majid','Mohsin'], 
        'lastname': ['Kumar', 'Jacob', 'Raghavan', 'Singh', 'Khan','Khan'], 
        'employmenttype': ['Service', 'Business', 'Student', 'Service', 'Business','Business'],
        'country' :['India','USA','USA','Sweden','Australia','Germany']}


df = pd.DataFrame(data, columns = ['firstname','lastname','employmenttype','country'])

print(df)

  firstname  lastname employmenttype    country
0      Arun     Kumar        Service      India
1      Jebu     Jacob       Business        USA
2    Venkat  Raghavan        Student        USA
3     Rekha     Singh        Service     Sweden
4     Majid      Khan       Business  Australia
5    Mohsin      Khan       Business    Germany

In [82]:
df1=pd.get_dummies(df["employmenttype"])
df2=pd.get_dummies(df['country'])
print(df1)
df2

   Business  Service  Student
0         0        1        0
1         1        0        0
2         0        0        1
3         0        1        0
4         1        0        0
5         1        0        0

   Australia  Germany  India  Sweden  USA
0          0        0      1       0    0
1          0        0      0       0    1
2          0        0      0       0    1
3          0        0      0       1    0
4          1        0      0       0    0
5          0        1      0       0    0

In [83]:
df

  firstname  lastname employmenttype    country
0      Arun     Kumar        Service      India
1      Jebu     Jacob       Business        USA
2    Venkat  Raghavan        Student        USA
3     Rekha     Singh        Service     Sweden
4     Majid      Khan       Business  Australia
5    Mohsin      Khan       Business    Germany

In [84]:
frames=[df,df1,df2]
result=pd.concat(frames,axis=1)
result.drop(["employmenttype","country"],axis=1,inplace=True)
result

,firstname,lastname,Business,Service,Student,Australia,Germany,India,Sweden,USA
0,Arun,Kumar,0,1,0,0,0,1,0,0
1,Jebu,Jacob,1,0,0,0,0,0,0,1
2,Venkat,Raghavan,0,0,1,0,0,0,0,1
3,Rekha,Singh,0,1,0,0,0,0,1,0
4,Majid,Khan,1,0,0,1,0,0,0,0
5,Mohsin,Khan,1,0,0,0,1,0,0,0

Concatination

In [86]:
import pandas as pd
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [90]:
ap_weather=pd.DataFrame({
    "city":['kadapa','kurnool','pdtr'],
    "temperature":[42,43,40],
    "humidity":[50,48,52]
})
ap_weather

      city  temperature  humidity
0   kadapa           42        50
1  kurnool           43        48
2     pdtr           40        52

In [91]:
df=pd.concat([india_weather,ap_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0    kadapa           42        50
1   kurnool           43        48
2      pdtr           40        52

In [92]:
#ignore index
df=pd.concat([india_weather,ap_weather],ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3    kadapa           42        50
4   kurnool           43        48
5      pdtr           40        52

In [93]:
#concatinate using keys
df=pd.concat([india_weather,ap_weather],keys=["india",'ap'])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
ap    0    kadapa           42        50
      1   kurnool           43        48
      2      pdtr           40        52

'''
Finding Relationships
A great aspect of the Pandas module is the corr() method.

The corr() method calculates the relationship between each column in your data set.
'''

'''
Perfect Correlation:
We can see that "Duration" and "Duration" got the number 1.000000, 
which makes sense, each column always has a perfect relationship with itself.

Good Correlation:
"Duration" and "Calories" got a 0.922721 correlation, which is a very good correlation, 
and we can predict that the longer you work out, the more calories you burn, and the other way around:
if you burned a lot of calories, you probably had a long work out.

Bad Correlation:
"Duration" and "Maxpulse" got a 0.009403 correlation, which is a very bad correlation, 
meaning that we can not predict the max pulse by just looking at the duration of the work out, and vice versa.

'''

In [96]:
import pandas as pd  
emp = {"Name": ["Parker", "Smith", "William", "Parker"],  
"Age": [21, 32, 29, 21]}  
info = pd.DataFrame(emp)  
print(info)
print("--------------------")
info = info.drop_duplicates()  
print(info)

      Name  Age
0   Parker   21
1    Smith   32
2  William   29
3   Parker   21
--------------------
      Name  Age
0   Parker   21
1    Smith   32
2  William   29

APPLY

In [97]:
def cal_sum(Nikhil):
    return Nikhil+1
data = {
    "x":[10,20,30],
    "y":[100,200,300]
}
df = pd.DataFrame(data)
print(df)

    x    y
0  10  100
1  20  200
2  30  300

In [98]:
x=df.apply(cal_sum)
print(x)

    x    y
0  11  101
1  21  201
2  31  301

In [99]:
#explore sql joins
import pandas as pd
data1 = {
  "name": ["Sally", "Mary", "John"],
  "age": [50, 40, 30]
}

data2 = {
  "name": ["Sally", "Peter", "Micky"],
  "age": [77, 44, 22]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print(df2)
print("...........")
newdf = df1.merge(df2, how='right')
print(newdf)

    name  age
0  Sally   50
1   Mary   40
2   John   30
    name  age
0  Sally   77
1  Peter   44
2  Micky   22
...........
    name  age
0  Sally   77
1  Peter   44
2  Micky   22

In [102]:
print(df1)
print("------------")
print(df2)

    name  age
0  Sally   50
1   Mary   40
2   John   30
------------
    name  age
0  Sally   77
1  Peter   44
2  Micky   22

In [103]:
df3=pd.merge(df1,df2,on="name",how="outer") # union
df3

    name  age_x  age_y
0  Sally   50.0   77.0
1   Mary   40.0    NaN
2   John   30.0    NaN
3  Peter    NaN   44.0
4  Micky    NaN   22.0

In [104]:
df3=pd.merge(df1,df2,on="name",how="left") # union
df3

    name  age_x  age_y
0  Sally     50   77.0
1   Mary     40    NaN
2   John     30    NaN

In [105]:
df3=pd.merge(df1,df2,on="name",how="right") # union
df3

    name  age_x  age_y
0  Sally   50.0     77
1  Peter    NaN     44
2  Micky    NaN     22

In [106]:
df3=pd.merge(df1,df2,on="name",how="inner") # union
df3

    name  age_x  age_y
0  Sally     50     77